---
type: DocumentVersion
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# DocumentVersion

`Autodesk.Revit.DB.DocumentVersion` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2015 | `public bool IsEqual ( DocumentVersion other )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NumberOfSaves | 2015 | `public int NumberOfSaves { get ; }` |
| Property | VersionGUID | 2015 | `public Guid VersionGUID { get ; }` |